#pragma once

// Name: SanAndreas, Version: 1.0.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct ButtonTemplateModifiers.ButtonTemplateModifiers
// 0x0118
struct FButtonTemplateModifiers
{
	class UTexture2D*                                  Image_2_594B49694C671B303DE0699A36A15EA3;                  // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox2D                                      ImageUVs_42_DCD3F6ED459814AD9D7D15A1466850CE;              // 0x0008(0x0014) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	unsigned char                                      UnknownData_OOA9[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FSlateColor                                 Color_5_D8CDC0374EFFE84369CA1591BBA8F975;                  // 0x0020(0x0028) (Edit, BlueprintVisible)
	struct FVector2D                                   ImageSheer_8_77C7B5484CC455D7262BB58DC3C7A74B;             // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                                 TextColor_11_959524B14EF4F9B95D70A7A176DB93F2;             // 0x0050(0x0028) (Edit, BlueprintVisible)
	struct FSlateFontInfo                              Font_14_80D8C4A049BBB745A376DE9CC8862093;                  // 0x0078(0x0058) (Edit, BlueprintVisible, HasGetValueTypeHash)
	TEnumAsByte<SlateCore_EHorizontalAlignment>        TextHorizontalAlignment_17_79B0FCF84D38A71C205D1DB4356E1EDD; // 0x00D0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	unsigned char                                      UnknownData_2CCD[0x3];                                     // 0x00D1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FMargin                                     TextMargin_20_431C4E994A2898ED811F29B812FD6AB5;            // 0x00D4(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                                ShadowColor_24_DA06C65047AA5DB5F4F779B1DCB2FD00;           // 0x00E4(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                                   ShadowOffset_26_86238E16497318448263DBBAC5BF6EEA;          // 0x00F4(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FButtonShadowModifiers                      ImageShadow_45_CEA254E2462FCB9DD02CDDB00DD3DD7B;           // 0x00FC(0x001C) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
