#pragma once

// Name: SanAndreas, Version: 1.0.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function UI_HUD_RadioWheel_Base.UI_HUD_RadioWheel_Base_C.GetWeaponWheelItemOffset
struct UUI_HUD_RadioWheel_Base_C_GetWeaponWheelItemOffset_Params
{
	float                                              NewParam;                                                  // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_HUD_RadioWheel_Base.UI_HUD_RadioWheel_Base_C.GetRadioWheelItemOffset
struct UUI_HUD_RadioWheel_Base_C_GetRadioWheelItemOffset_Params
{
	float                                              NewParam;                                                  // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_HUD_RadioWheel_Base.UI_HUD_RadioWheel_Base_C.SetupSections
struct UUI_HUD_RadioWheel_Base_C_SetupSections_Params
{
	int                                                NumSections;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_HUD_RadioWheel_Base.UI_HUD_RadioWheel_Base_C.AddTextToImages
struct UUI_HUD_RadioWheel_Base_C_AddTextToImages_Params
{
	TArray<struct FString>                             Array;                                                     // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function UI_HUD_RadioWheel_Base.UI_HUD_RadioWheel_Base_C.SetupImages
struct UUI_HUD_RadioWheel_Base_C_SetupImages_Params
{
	TArray<struct FSlotImageStruct>                    Images;                                                    // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function UI_HUD_RadioWheel_Base.UI_HUD_RadioWheel_Base_C.SetSelection
struct UUI_HUD_RadioWheel_Base_C_SetSelection_Params
{
	int                                                Index;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_HUD_RadioWheel_Base.UI_HUD_RadioWheel_Base_C.PreConstruct
struct UUI_HUD_RadioWheel_Base_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function UI_HUD_RadioWheel_Base.UI_HUD_RadioWheel_Base_C.Construct
struct UUI_HUD_RadioWheel_Base_C_Construct_Params
{
};

// Function UI_HUD_RadioWheel_Base.UI_HUD_RadioWheel_Base_C.ExecuteUbergraph_UI_HUD_RadioWheel_Base
struct UUI_HUD_RadioWheel_Base_C_ExecuteUbergraph_UI_HUD_RadioWheel_Base_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
