#pragma once

// Name: ViceCity, Version: 1.0.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct TimeOfDayData.TimeOfDayData
// 0x00A4
struct FTimeOfDayData
{
	float                                              PresetTimeOfDay_48_72731B344467C1038DE1E18CEB2DA386;       // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                                SkyUpperColor_36_F574B1FF4C660D607018378D4D29D5D8;         // 0x0004(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                                SkyLowerColor_37_9AE60C56438D767F5189779E892918F6;         // 0x0014(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                                CloudsUpperColor_38_427730AB4B57918C2621AC9E42481B18;      // 0x0024(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                                CloudsLowerColor_39_8C51A73643E77F6D68DF0C9FB66307B7;      // 0x0034(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                                CloudsSecondaryColor_53_DC9F541A4A5DF218D25F3BAEFD108CC9;  // 0x0044(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                                CloudsBackground_40_C26ACFC54FD13F33D88102AE41FC8C47;      // 0x0054(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                                SunColor_41_4127FF7441301541CCC14C97D84E54F5;              // 0x0064(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                                MoonColor_42_A8304BE24B8F8E787E683A8FEA4D486C;             // 0x0074(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                                StarsColor_43_5B3DF4A1431B005F9583B498B90E49FC;            // 0x0084(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                                FogColor_44_3CDDDC604F2BA0AD72A137903A4167F5;              // 0x0094(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
