#pragma once

// Name: GTA III, Version: 1.0.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class GTABase.DFFExtraData
// 0x0020 (FullSize[0x0050] - InheritedSize[0x0030])
class UDFFExtraData : public UDataAsset
{
public:
	TArray<struct FGTAModelData>                       ModelData;                                                 // 0x0030(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	struct FString                                     TextFileLocation;                                          // 0x0040(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.DFFExtraData");
		return ptr;
	}



	void CheckAllReferences();
};

// Class GTABase.DistantHLODBuilder
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UDistantHLODBuilder : public UDataAsset
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.DistantHLODBuilder");
		return ptr;
	}



	void BuildAtlas();
};

// Class GTABase.GTAGameMode
// 0x0038 (FullSize[0x02F8] - InheritedSize[0x02C0])
class AGTAGameMode : public AGameModeBase
{
public:
	class UGameterface*                                Gameface;                                                  // 0x02C0(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_TEB5[0x30];                                    // 0x02C8(0x0030) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.GTAGameMode");
		return ptr;
	}



	class UGameterface* GetGameterface();
};

// Class GTABase.Gameterface
// 0x0708 (FullSize[0x0730] - InheritedSize[0x0028])
class UGameterface : public UObject
{
public:
	unsigned char                                      UnknownData_UEMK[0x8];                                     // 0x0028(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class ALevelSequenceActor*                         CinematicPlayer;                                           // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_WSOF[0x20];                                    // 0x0038(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FGTAStreamRequest>                   StreamRequests;                                            // 0x0058(0x0010) (ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UGTAEffectLibrary*                           EffectsLibrary;                                            // 0x0068(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      Cinematics[0x10];                                          // 0x0070(0x0010) UNKNOWN PROPERTY: ArrayProperty
	class UGTACinematicDB*                             CinematicDB;                                               // 0x0080(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_9DQJ[0x8];                                     // 0x0088(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      CarRecordings[0x28];                                       // 0x0088(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UGTAHaptics*                                 Haptics;                                                   // 0x00B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEntityLinker*                               EntityLink;                                                // 0x00C0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ExtraPedDensityMult;                                       // 0x00C8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ExtraPedDistanceMult;                                      // 0x00CC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ExtraCarDensityMult;                                       // 0x00D0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ExtraCarDistanceMult;                                      // 0x00D4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_SV99[0x8];                                     // 0x00D8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      LoadedObjects[0x50];                                       // 0x00D8(0x0050) UNKNOWN PROPERTY: SetProperty
	struct FName                                       CurrentCutscene;                                           // 0x0130(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGTAScalability*                             Scalability;                                               // 0x0138(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGTARadar*                                   Radar;                                                     // 0x0140(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGTATargetHalo*                              TargetHalo;                                                // 0x0148(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGTASkidmarks*                               Skidmarks;                                                 // 0x0150(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGTARopes*                                   Ropes;                                                     // 0x0158(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGTABloodyFootprints*                        BloodyFootprints;                                          // 0x0160(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGTASceneProbeListing*                       SceneProbes;                                               // 0x0168(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGTAWater*                                   Water;                                                     // 0x0170(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGTATexLookup*                               TextureLookup;                                             // 0x0178(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFFExtraData*                               ModelData;                                                 // 0x0180(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGTAPathfindNodes*                           PathfindingNodes;                                          // 0x0188(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFont*>                               Fonts;                                                     // 0x0190(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UGTASoundPak*>                        Paks;                                                      // 0x01A0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UProcTextData*                               RoadSignText;                                              // 0x01B0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceConstant*>           RoadSignPalettes;                                          // 0x01B8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UGTASoundBank*>                       Streams;                                                   // 0x01C8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UIMGFile*>                            IMGs;                                                      // 0x01D8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UClass*>                              Markers;                                                   // 0x01E8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UClass*                                      TargetHaloClass;                                           // 0x01F8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      FireClass;                                                 // 0x0200(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      DecalHelperClass;                                          // 0x0208(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceConstant*                   DefaultScorchedMI;                                         // 0x0210(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              WaterDetailDistance;                                       // 0x0218(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              WaterDetailDistance_InBoat;                                // 0x021C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               NeedsInvincibilityCheck;                                   // 0x0220(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               InvincibilityNewGameCheck;                                 // 0x0221(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1Q4X[0x6];                                     // 0x0222(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class USkeletalMesh*>                       SKMsSetUpForGangSigns;                                     // 0x0228(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FSpecialCutsceneMapping>             SpecialCutsceneMappings;                                   // 0x0238(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UMaterialInterface*                          DefaultHeadlightOffMaterial;                               // 0x0248(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                          DefaultHeadlightOnMaterial;                                // 0x0250(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      BloodPoolClass;                                            // 0x0258(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      SpecialCharacterExcludeFromWindFlapping[0x50];             // 0x0260(0x0050) UNKNOWN PROPERTY: SetProperty
	class UUI_GTAHUDDrawer*                            CurrentHudDrawer;                                          // 0x02B0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUI_GTAHUDDrawer*                            CurrentPriorityHudDrawer;                                  // 0x02B8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FString, class UClass*>                TransitionMap;                                             // 0x02C0(0x0050) (Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	class UUserWidget*                                 CurrentMenu;                                               // 0x0310(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0P72[0x4];                                     // 0x0318(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	bool                                               LaunchedFromMainMenu;                                      // 0x031C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsMenuMapUpdating;                                         // 0x031D(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZL5D[0x2];                                     // 0x031E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                listeningForKeyMapping;                                    // 0x0320(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CXHH[0xC];                                     // 0x0324(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FHUDItem>                            items;                                                     // 0x0330(0x0010) (ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DERC[0x130];                                   // 0x0340(0x0130) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<int, int>                                     CEntityRefCounter;                                         // 0x0470(0x0050) (NativeAccessSpecifierPublic)
	struct FLinearColor                                DynamicColorBoost;                                         // 0x04C0(0x0010) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHelpTextOverrides>                  HelpTextOverrides;                                         // 0x04D0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      CollisionCache[0x28];                                      // 0x04E0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      CollisionSectionContainer[0x28];                           // 0x0508(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      UnknownData_UWYU[0x10];                                    // 0x0530(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      PathIplContainer[0x28];                                    // 0x0530(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UGTARadioStream*                             RadioStreams;                                              // 0x0568(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      TrafficLightCache[0x28];                                   // 0x0570(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class AGTARTCaptureBase*                           ReflectionActor;                                           // 0x0598(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     CurrentReflectionPosition;                                 // 0x05A0(0x000C) (Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     TargetReflectionPosition;                                  // 0x05AC(0x000C) (Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                      ReflectionTargetContext;                                   // 0x05B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGTATimeOfDay*                               ActiveTOD;                                                 // 0x05C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7G4Y[0x8];                                     // 0x05C8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      SSRReflectionClass[0x28];                                  // 0x05C8(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	unsigned char                                      PlanarReflectionClass[0x28];                               // 0x05F8(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	unsigned char                                      CubeReflectionClass[0x28];                                 // 0x0620(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	TArray<struct FReflectionMaterialSetup>            ReflectionMaterialSetups;                                  // 0x0648(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UClass*                                      ChalkOutlineClass;                                         // 0x0658(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      CinematicCarClass;                                         // 0x0660(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      IFPFileContainer[0x28];                                    // 0x0668(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      UnknownData_C5F8[0x18];                                    // 0x0690(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class USkeletalMesh*                               SpecialBlankMeshForCutscenes;                              // 0x06A8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUI_DesignTimeUserWidget*                    SocialClubUI;                                              // 0x06B0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_RVKP[0x18];                                    // 0x06B8(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      IntroMovieClass;                                           // 0x06D0(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                     IntroMovieFile;                                            // 0x06D8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                     LowQualityIntroMovieFile;                                  // 0x06E0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUI_DesignTimeUserWidget*                    IntroMovieAsset;                                           // 0x06E8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64_t                                           FramesSinceLastLongDistanceCut;                            // 0x06F0(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                           VerticalBlurInstance;                                      // 0x06F8(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                           HorizontalBlurInstance;                                    // 0x0700(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGTAActivityManager*                         ActivityManager;                                           // 0x0708(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_J1YF[0x20];                                    // 0x0710(0x0020) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.Gameterface");
		return ptr;
	}



	bool WasRightBumperButtonJustPressed();
	bool WasLeftBumperButtonJustPressed();
	bool WasBackButtonJustPressed();
	bool WasAcceptButtonJustPressed();
	bool UseSystemFont();
	bool UseSocialClubInGameMenu();
	void UpdateMapCustomWaypoint();
	struct FString TheTextGet(const struct FString& Key, const struct FString& missionText);
	void StopIntroMovie();
	void StopCredits();
	void StartTransition(const struct FString& TransitionToStart);
	class UUserWidget* StartRemapping(int mappingID);
	void StartNewGameFromMenu();
	void StartLoadingTransition();
	void StartIntroMovie();
	class AGTAExplosion* SpawnExplosion(const struct FVector& Location, TEnumAsByte<GTABase_EGTAExplosionType> Type, TEnumAsByte<GTABase_EGTAExplosionSurface> Surface, const struct FVector& SurfaceNormal, float Scale, int DebrisCount, class AActor* ExplodingActor, bool bSuppressLight);
	void SocialClubSignUp();
	void SocialClubSignOut();
	void SocialClubSignIn();
	void SocialClubShowAchievements();
	bool SocialClubIsLinked();
	bool SocialClubAreServicesAvailable();
	bool STATIC_SnapToWorldZ(struct FVector* Coord, float AdditionalZOffset);
	bool SlotHasSave(int slotnum);
	void ShowHUDDrawer(bool Visible, bool CreateIfNotMade);
	bool ShouldUseTransitionWarnings(float* TimeBeforeWarning);
	bool ShouldShowFullOptions();
	void STATIC_SetUserFocusToGameViewport();
	void SetTransitionStateFadeTime(TEnumAsByte<GTABase_EGTATransitionState> StateToChange, float TimeToFade);
	void SetMenuTransitionStateFadeTime(TEnumAsByte<GTABase_EGTATransitionState> StateToChange, float TimeToFade);
	void SetLoadingTransitionProgress(float Progress);
	void SetCustomWaypoint(const struct FVector& position);
	void SaveKeyboardMappings();
	void SaveDataInSlot(int SlotIndex);
	bool ResumeGameFromMenu();
	bool RestartWithFreshMenu();
	void ReplaceGameSpecificImageTags(struct FString* QueuedMessage);
	bool RefreshSocialClubAchivements();
	void RefreshMenuUserInfo();
	void PromptLogin();
	void PlayHapticEffectBP(TEnumAsByte<GTABase_EHapticEffectType> Type);
	bool PlatformRequiresLogin();
	void OnAudioTabChanged(bool wasSelected);
	bool MoveMenuToGameTab(TEnumAsByte<GTABase_EGTASaveTabState> tabState);
	void MissionRetryCallback(bool doRetry);
	void MenuMapExtra();
	bool LoadDataInSlot(int SlotIndex);
	bool IsViewport4kOrGreater();
	bool IsVeryWideScreen();
	bool isSlotCheckpointSave(int slotnum);
	bool isSlotAutoSave(int slotnum);
	bool IsShowingControllerReconnectScreen();
	bool IsShowAllOptions();
	bool IsReleaseBuild();
	bool IsPlayingGame();
	bool STATIC_IsJapaneseBuild();
	bool IsIntroMoviePlaying(bool AllowHandleStop);
	bool IsInCredits();
	bool IsCurrentTransition(const struct FString& Name);
	bool IsActiveControllerLoggedIn();
	void InterruptCurrentTransition(const struct FString& TransitionToStart, TEnumAsByte<GTABase_EGTATransitionState> startingState, bool takeOldOpacity);
	void InterruptCurrentMenuTransition(const struct FString& TransitionToStart, TEnumAsByte<GTABase_EGTATransitionState> startingState, bool takeOldOpacity);
	bool HasSaveData();
	bool HasCurrentTransitionScreen(bool CheckOnlyInGameTransitions);
	void GrabFocus();
	float STATIC_GetWorldZ(const struct FVector& FromCoord, bool* success);
	struct FString GetVersionString();
	class UTexture2D* GetUVMappingForMenuTabPrev(float* U, float* V, float* ULength, float* VLength);
	class UTexture2D* GetUVMappingForMenuTabNext(float* U, float* V, float* ULength, float* VLength);
	class UTexture2D* GetUVImageForHUDMapping(TEnumAsByte<GTABase_EHIDMapping> mapping, float* U, float* V, float* ULength, float* VLength);
	class UTexture2D* GetUserNameAndImage(struct FString* OutName);
	class UUITransition* GetTransitionManager();
	TArray<struct FString> GetStats(TArray<struct FString>* StatValues, struct FString* CriminalRating);
	TArray<struct FSCAchive> GetSocialClubAchivements();
	class UClass* GetScalabilityClass();
	TArray<struct FString> GetSaveDataNames();
	struct FString GetSaveDataName(int SlotIndex);
	void GetRightStickValues(float* X, float* Y);
	class URage* GetRageActor();
	int GetRadioStationOffset();
	TEnumAsByte<GTABase_EPlatformType> STATIC_GetPlatformType();
	float GetOptionTextSize();
	float GetOptionHelpTextSize();
	int GetNextValidLanguageIndex(bool IsLanguage, bool Forward, int currentIndex);
	float GetMapZoomOut();
	float GetMapZoomIn();
	struct FString GetMappingStringForButton(int nButtonID, int whichType);
	TArray<struct FName> GetMapLegendNames();
	void GetMapLegend(TArray<class UTexture2D*>* Textures, TArray<struct FText>* Strings);
	void GetMapAreaName(const struct FVector& WorldPosition, struct FString* OutName);
	void GetLeftStickValues(float* X, float* Y);
	int GetLastSaveSlotIndex();
	TArray<struct FKeyboardDisplayStrings> GetKeyboardMappings(int whichType);
	class UTexture2D* GetHIDTexture();
	struct FVector GetGTAPlayerPosition();
	bool GetGroundZCoord(const struct FVector& FromCoord, struct FVector* OutCoord);
	TEnumAsByte<GTABase_EGTAInputType> GetCurrentInputType();
	bool GetButtonMappingReleased(TEnumAsByte<GTABase_EHIDMapping> mapping);
	bool GetButtonMappingJustPressed(TEnumAsByte<GTABase_EHIDMapping> mapping);
	bool GetButtonMappingIsPressed(TEnumAsByte<GTABase_EHIDMapping> mapping);
	struct FString GetBriefString();
	int GetAppropriateGamepadTab();
	int GetActiveControllerIndex();
	bool GameHasGangsOverlay();
	bool GameHasFlightGamepadTab();
	bool GameHasBMXGamepadTab();
	void FreezeTime(int Hours, int Minutes, int Seconds);
	void ForceMapSwitchRefresh(bool MenuMode);
	void ExitGame();
	bool DoesLanguageUseLargerHeightSubtitles();
	bool DoesGameViewportHaveFocus();
	void DeleteSavedKeyboardMappings();
	void DeleteDataInSlot(int SlotIndex);
	void ContinueTransition(TEnumAsByte<GTABase_EGTATransitionState> toState);
	void ContinueMenuTransition(TEnumAsByte<GTABase_EGTATransitionState> toState);
	void CloseCurrentTransition();
	void CloseCurrentMenuTransition();
	void ClearCustomWaypoint();
	void CleanupCinematicActorOnEndPlay(class AActor* Actor, TEnumAsByte<Engine_EEndPlayReason> EndPlayReason);
	bool STATIC_CheckWorldLine(const struct FVector& Start, const struct FVector& finished, struct FVector* outCol, struct FVector* outNormal, bool bCheckBuildings, bool bCheckVehicles, bool bCheckPeds);
	void CheckShowAllOptionsChanged();
	void BPUpdateVolumeMixers();
	void AutoDestroyedParticleSystem(class UParticleSystemComponent* Component);
	bool AreMultipleTouchesDown();
	bool AllowMapJump();
	bool AllowCustomWaypointManagement();
	bool AllowActiveControllerSet();
};

// Class GTABase.EntityLinker
// 0x0050 (FullSize[0x0078] - InheritedSize[0x0028])
class UEntityLinker : public UObject
{
public:
	unsigned char                                      UnknownData_K1WO[0x50];                                    // 0x0028(0x0050) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.EntityLinker");
		return ptr;
	}



};

// Class GTABase.GTAOptionsList
// 0x0018 (FullSize[0x0048] - InheritedSize[0x0030])
class UGTAOptionsList : public UDataAsset
{
public:
	TEnumAsByte<GTABase_EGTASettingsCategory>          Category;                                                  // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CD8Z[0x7];                                     // 0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FGTAOptionsItemTemplate>             Options;                                                   // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.GTAOptionsList");
		return ptr;
	}



};

// Class GTABase.GTAFidelityOption
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UGTAFidelityOption : public UDataAsset
{
public:
	struct FText                                       OptionName;                                                // 0x0030(0x0018) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGTAFidelityChanges                         Changables;                                                // 0x0048(0x0044) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KMCV[0x4];                                     // 0x008C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.GTAFidelityOption");
		return ptr;
	}



};

// Class GTABase.GameterSettings
// 0x0200 (FullSize[0x0320] - InheritedSize[0x0120])
class UGameterSettings : public UGameUserSettings
{
public:
	unsigned char                                      UnknownData_1S8Y[0x4];                                     // 0x0120(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FGTASettings_Graphics                       Graphics;                                                  // 0x0124(0x007C) (Edit, BlueprintVisible, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGTASettings_Controls                       Controls;                                                  // 0x01A0(0x0048) (Edit, BlueprintVisible, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGTASettings_Gameplay                       Gameplay;                                                  // 0x01E8(0x0018) (Edit, BlueprintVisible, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGTASettings_Audio                          Audio;                                                     // 0x0200(0x0020) (Edit, BlueprintVisible, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGTASettings_Language                       Language;                                                  // 0x0220(0x001C) (Edit, BlueprintVisible, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IBLM[0x4];                                     // 0x023C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     DefaultClassName;                                          // 0x0240(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                FidelitySetting;                                           // 0x0250(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                DefaultsVersion;                                           // 0x0254(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                HeldLastResolution;                                        // 0x0258(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                HeldLastScreenMode;                                        // 0x025C(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                HeldLastOutputMonitor;                                     // 0x0260(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               RequiresRestart;                                           // 0x0264(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDisableDynamicResolution;                                 // 0x0265(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZTZ6[0x2];                                     // 0x0266(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FName>                               UserOverrideCVars;                                         // 0x0268(0x0010) (ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FString>                             UserOverrideValues;                                        // 0x0278(0x0010) (ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FGTAFidelitySettings>                PlatformFidelitySettings;                                  // 0x0288(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                LastRefreshRate;                                           // 0x0298(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LNRL[0x4];                                     // 0x029C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     LastOutputMonitorName;                                     // 0x02A0(0x0010) (ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                lastSystemLanguage;                                        // 0x02B0(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ForcedSCEnvironment;                                       // 0x02B4(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           TotalTimePlayed;                                           // 0x02B8(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QUJV[0x10];                                    // 0x02BC(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                GPUBenchmarkScore;                                         // 0x02CC(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0CGZ[0x50];                                    // 0x02D0(0x0050) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.GameterSettings");
		return ptr;
	}



	void UpdateFidelitySettings(bool SkipCallback);
	void UpdateDefaultVersion(bool SkipSave);
	void UpdateAllGraphicsSettings();
	void SetupGlobalSettingsCallbacks();
	void SetResolutionToDefault(bool doConfirmVideoMode);
	void SetIntValue(const struct FName& VariableName, int NewValue);
	void SetInitialScreenValues();
	void SetFloatValue(const struct FName& VariableName, float NewValue);
	void SetBoolValue(const struct FName& VariableName, bool NewValue);
	void RevertOption(const struct FName& OptionName);
	void ResetSettingsToPlatformDefault(TEnumAsByte<GTABase_EGTASettingsCategory> Category, bool SkipDisplayChanges, bool SkipSave);
	void ResetDefaultCheck();
	void RefreshSettingsOnFirstLoad(bool ForceReset);
	void OnTextureQualitySet();
	void OnShadowSet();
	void OnRTXSet();
	void OnResolutionSet(bool ApplySettings);
	void OnReflectionQualitySet();
	void OnOutputMonitorSet();
	void OnMotionBlurSet();
	void OnLensFlareSet();
	void OnLanguageSet();
	void OnFrameRateLimitSet(bool ApplySettings);
	void OnFrameRateLimitPCSet(bool ApplySettings);
	void OnDistanceScaleSet();
	void OnDisplayModeSet(bool ApplySettings);
	void OnDepthOfFieldSet();
	void OnCloudQualitySet();
	void OnCarReflectionMethodSet();
	void OnBloomSet();
	void OnAspectRatioSet();
	void OnAOSet();
	void OnAnisotropicSet();
	void NormalizeInitialScreenSize();
	void InitializeGlobalSettings();
	bool HasEverSetToDefault();
	void GTASaveSettings(const struct FName& SettingName);
	TArray<struct FText> GetSelectionNamesForEmptyEntry(const struct FName& EntryName);
	TArray<struct FText> GetScreenResolutionNames();
	TEnumAsByte<GTABase_EGTAPlatforms> GetPlatformToEmulate();
	class UClass* GetPlatformDefaults(TEnumAsByte<GTABase_EGTAPlatforms> PlatformOverride, bool IsEditor);
	class UDefaultGameterSettings_Rules* GetPlatformDefaultRules();
	int GetPCFidelitySetting();
	int GetNumberValue(const struct FName& VariableName);
	TArray<struct FText> GetListOfFidelityOptionNamesFromSettings(TEnumAsByte<GTABase_EGTAPlatforms> PlatformOverride, bool IsEditor);
	int GetIntValue(const struct FName& VariableName);
	float GetFloatValue(const struct FName& VariableName);
	int GetFidelityOptionsNum(TEnumAsByte<GTABase_EGTAPlatforms> PlatformOverride, bool IsEditor);
	TArray<struct FText> GetFidelityOptionNames(TEnumAsByte<GTABase_EGTAPlatforms> PlatformOverride);
	class UGTAFidelityOption* GetCurrentFidelityOption(int CurrentSelection, TEnumAsByte<GTABase_EGTAPlatforms> PlatformOverride, bool IsEditor);
	bool GetBoolValue(const struct FName& VariableName);
	void FinalOptionCheck(const struct FName& OptionName);
	bool CheckSpecialOptionEnabled(const struct FName& OptionName, int* ErrorCode);
	void CheckDisplayModeAndUpdateSettings();
};

// Class GTABase.DefaultGameterSettings_Rules
// 0x0120 (FullSize[0x0148] - InheritedSize[0x0028])
class UDefaultGameterSettings_Rules : public UObject
{
public:
	struct FGTASettings_Graphics                       Graphics;                                                  // 0x0028(0x007C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGTASettings_Controls                       Controls;                                                  // 0x00A4(0x0048) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGTASettings_Gameplay                       Gameplay;                                                  // 0x00EC(0x0018) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGTASettings_Audio                          Audio;                                                     // 0x0104(0x0020) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGTASettings_Language                       Language;                                                  // 0x0124(0x001C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int                                                FidelitySetting;                                           // 0x0140(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_HRMI[0x4];                                     // 0x0144(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.DefaultGameterSettings_Rules");
		return ptr;
	}



};

// Class GTABase.GrungeProxy
// 0x0018 (FullSize[0x0238] - InheritedSize[0x0220])
class AGrungeProxy : public AActor
{
public:
	unsigned char                                      UnknownData_7S55[0x8];                                     // 0x0220(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UProceduralMeshComponent*>            BuiltComponents;                                           // 0x0228(0x0010) (Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.GrungeProxy");
		return ptr;
	}



};

// Class GTABase.GrungePlacementBase
// 0x0018 (FullSize[0x0238] - InheritedSize[0x0220])
class AGrungePlacementBase : public AActor
{
public:
	struct FGuid                                       Guid;                                                      // 0x0220(0x0010) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIncludeInMapProxy;                                        // 0x0230(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SKPT[0x7];                                     // 0x0231(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.GrungePlacementBase");
		return ptr;
	}



};

// Class GTABase.GTAActivityManager
// 0x00C0 (FullSize[0x00E8] - InheritedSize[0x0028])
class UGTAActivityManager : public UObject
{
public:
	unsigned char                                      UnknownData_VT3D[0xC0];                                    // 0x0028(0x00C0) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.GTAActivityManager");
		return ptr;
	}



};

// Class GTABase.GTAActor
// 0x0080 (FullSize[0x02A0] - InheritedSize[0x0220])
class AGTAActor : public AActor
{
public:
	uint32_t                                           ModelID;                                                   // 0x0220(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_LZQ2[0x4];                                     // 0x0224(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<int, class UPrimitiveComponent*>              AttachedFrameComponents;                                   // 0x0228(0x0050) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FTimerHandle                                FadeDelegate;                                              // 0x0278(0x0008) (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              CurrentAlpha;                                              // 0x0280(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_QF1Q[0x4];                                     // 0x0284(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      bMaskFromDecalHeadlights : 1;                              // 0x0288(0x0001) BIT_FIELD (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bShouldImpostorInProxy : 1;                                // 0x0288(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bUseVertexAO : 1;                                          // 0x0288(0x0001) BIT_FIELD (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bUseVertexUplighting : 1;                                  // 0x0288(0x0001) BIT_FIELD (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bUseDynamicVolumetricLookup : 1;                           // 0x0288(0x0001) BIT_FIELD (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bUseStaticVolumetricLookup : 1;                            // 0x0288(0x0001) BIT_FIELD (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bIgnoreForVolGridBuilding : 1;                             // 0x0288(0x0001) BIT_FIELD (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bSpawnedFromGTA : 1;                                       // 0x0288(0x0001) BIT_FIELD (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bProminent : 1;                                            // 0x0289(0x0001) BIT_FIELD (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bMultipleMeshComponents : 1;                               // 0x0289(0x0001) BIT_FIELD (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bTickLessOffScreen : 1;                                    // 0x0289(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bConstructSeparateProxy : 1;                               // 0x0289(0x0001) BIT_FIELD (Edit, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint16_t                                           VariationSeed;                                             // 0x028A(0x0002) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DynamicAO;                                                 // 0x028C(0x0004) (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                      DynamicUplighting;                                         // 0x0290(0x0004) (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              UplightStrength;                                           // 0x0294(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              AOStrength;                                                // 0x0298(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_M64L[0x4];                                     // 0x029C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.GTAActor");
		return ptr;
	}



	void TimeChanged(bool bEditor);
	void SetScorched(bool scorched);
	void SetDamaged(bool damaged);
	void SetAlpha(float withAlpha);
	float GetTimeOfDay();
	void CheckTreeFarShadowSetting();
	void AddCollisionEffects(float impulseAmt, const struct FVector& Pos, const struct FVector& Dir);
};

// Class GTABase.GTASMActor
// 0x0008 (FullSize[0x02A8] - InheritedSize[0x02A0])
class AGTASMActor : public AGTAActor
{
public:
	class UStaticMeshComponent*                        Mesh;                                                      // 0x02A0(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.GTASMActor");
		return ptr;
	}



};

// Class GTABase.GTASKActor
// 0x0080 (FullSize[0x0320] - InheritedSize[0x02A0])
class AGTASKActor : public AGTAActor
{
public:
	class UGTAPoseableComponent*                       Mesh;                                                      // 0x02A0(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bHasBoneTransformTweaks;                                   // 0x02A8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_O9EW[0x7];                                     // 0x02A9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<class USkeletalMesh*, struct FSkeletonToSkeletonMap> maps;                                                      // 0x02B0(0x0050) (Transient, Protected, NativeAccessSpecifierProtected)
	bool                                               bNeedsRawToFinalPose;                                      // 0x0300(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_NL3A[0x1F];                                    // 0x0301(0x001F) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.GTASKActor");
		return ptr;
	}



	class USkeleton* GetOverrideSkeleton();
	struct FTransform GetBoneTransformTweak(const struct FTransform& InTransform, const struct FName& InBoneName, bool* OutShouldRemove, const struct FName& TweakType);
};

// Class GTABase.GTAAOSkeletalProxy
// 0x0088 (FullSize[0x0328] - InheritedSize[0x02A0])
class AGTAAOSkeletalProxy : public AGTAActor
{
public:
	class UStaticMeshComponent*                        ConstructedComponent;                                      // 0x02A0(0x0008) (Edit, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                        AccompanyComponent;                                        // 0x02A8(0x0008) (Edit, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UStaticMeshComponent*>                WheelComponents;                                           // 0x02B0(0x0010) (Edit, ExportObject, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UStaticMesh*                                 GeneratedMesh;                                             // 0x02C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                               SrcMesh;                                                   // 0x02C8(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             ExcludeBones;                                              // 0x02D0(0x0010) (Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                               bIncludeTranslucents;                                      // 0x02E0(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAddWheels;                                                // 0x02E1(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2BTE[0x2];                                     // 0x02E2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              WheelScaling;                                              // 0x02E4(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSkelProxyBoneTweak>                 BoneTweaks;                                                // 0x02E8(0x0010) (Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector2D                                   MinMaxAO;                                                  // 0x02F8(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                                 AccompanyMesh;                                             // 0x0300(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             OnlyTransferBones;                                         // 0x0308(0x0010) (Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UMaterialInstanceConstant*                   WindowMIC;                                                 // 0x0318(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_D7Q5[0x8];                                     // 0x0320(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class GTABase.GTAAOSkeletalProxy");
		return ptr;
	}



	void ConstructStatic();
	void ApplyVertexColor();
};

// Class GTABase.GTASKProxyActor
// 0x0038 (FullSize[0x0358] - InheritedSize[0x0320])
class AGTASKProxyActor : public AGTASKActor
{
public:
	int                                                CurSeed;                                                   // 0x0320(0x0004) (Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                                SkinColorMult;                                             // 0x0324(0x0010) (Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                                ClothingColorMult;                                         // 0x0334(0x0010) (Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                                AccessoryColorMult;                                        // 0x0344(0x0010) (Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
