#pragma once

// Name: GTA III, Version: 1.0.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct TimeOfDayCurves.TimeOfDayCurves
// 0x0050
struct FTimeOfDayCurves
{
	class UCurveLinearColor*                           SkyUpperColorCurve_14_F574B1FF4C660D607018378D4D29D5D8;    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                           SkyLowerColorCurve_15_9AE60C56438D767F5189779E892918F6;    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                           CloudsUpperColorCurve_16_427730AB4B57918C2621AC9E42481B18; // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                           CloudsLowerColorCurve_17_8C51A73643E77F6D68DF0C9FB66307B7; // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                           CloudsBackgroundCurve_18_C26ACFC54FD13F33D88102AE41FC8C47; // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                           CloudsSecondaryColorCurve_31_EE55225E47F0CD95AF3DED9A93746791; // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                           SunColorCurve_19_4127FF7441301541CCC14C97D84E54F5;         // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                           MoonColorCurve_20_A8304BE24B8F8E787E683A8FEA4D486C;        // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                           StarsColorCurve_22_5B3DF4A1431B005F9583B498B90E49FC;       // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                           FogColorCurve_26_3CDDDC604F2BA0AD72A137903A4167F5;         // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
